#为了方便用户在不同目录之间切换，Bash 提供了目录堆栈功能。

#1.cd -
#Bash 可以记忆用户进入过的目录。默认情况下，只记忆前一次所在的目录，cd -命令可以返回前一次的目录。

#2.pushd，popd
#pushd命令的用法类似cd命令，可以进入指定的目录。
##第一次使用pushd命令时，会将当前目录先放入堆栈，然后将所要进入的目录也放入堆栈，位置在前一个记录的上方。以后每次使用pushd命令，都会将所要进入的目录，放在堆栈的顶部。

#popd命令不带有参数时，会移除堆栈的顶部记录，并进入新的堆栈顶部目录（即原来的第二条目录）。
##（1）-n 参数
##-n的参数表示仅操作堆栈，不改变目录。
##popd -n

##（2）整数参数
##这两个命令还可以接受一个整数作为参数，该整数表示堆栈中指定位置的记录（从0开始），作为操作对象。这时不会切换目录。
# 从栈顶算起的3号目录（从0开始），移动到栈顶
##$ pushd +3
# 从栈底算起的3号目录（从0开始），移动到栈顶
##$ pushd -3
# 删除从栈顶算起的3号目录（从0开始）
##$ popd +3
# 删除从栈底算起的3号目录（从0开始）
##$ popd -3

##（3）目录参数
##pushd可以接受一个目录作为参数，表示将该目录放到堆栈顶部，并进入该目录。
##$ pushd dir

#3.dirs 命令
#dirs命令可以显示目录堆栈的内容，一般用来查看pushd和popd操作后的结果。
#$ dirs
#它有以下参数。
##-c：清空目录栈。
##-l：用户主目录不显示波浪号前缀，而打印完整的目录。
##-p：每行一个条目打印目录栈，默认是打印在一行。
##-v：每行一个条目，每个条目之前显示位置编号（从0开始）。
##+N：N为整数，表示显示堆顶算起的第 N 个目录，从零开始。
##-N：N为整数，表示显示堆底算起的第 N 个目录，从零开始。
